package level4.lesson3.path1;
//Создать переменную строкового типа, записать в качестве значения null ( обязательно без кавычек).
// На следующей строке попробовать вывести в консоль длину этой строки с помощью метода строки length().
// Убедится, что произошло исключение, написать в чат + и имя/тип исключения.
public class Task1 {
    public static void main(String[] args) {
        String string = null;
        System.out.println(string.length());
    }
}
