package level1.Examen;

public class Positiv {
    public static void main(String[] args) {
//
//Дано целое число. Если оно является положительным, то прибавить к не му 1;
//        в противном случае не изменять его. Вывести полученное число.
        int a = -20;

        if (a > 0) {
            a++;
        }
        System.out.println(a);

    }
}
